package com.example.fashionshop.models.enums;

public enum ProductGroupsNamesEnum {

    РОКЛИ_ГАЩЕРИЗОНИ("Рокли, гащеризони"),
    ЯКЕТА_ПАЛТА("Якета, палта"),
    БЛУЗИ_РИЗИ("Блузи, ризи"),
    ТЕНИСКИ_ТОПОВЕ("Тениски, топове"),
    ПАНТАЛОНИ("Панталони"),
    ДЪНКИ("Дънки"),
    ПОЛИ_КЪСИ_ПАНТАЛОНИ("Поли, къси панталони"),
    КОСТЮМИ("Костюми"),
    БАНСКИ_КОСТЮМИ("Бански костюми"),
    ОБЛЕКЛО_ЗА_БРЕМЕННИ_ЖЕНИ("Облекло за бременни жени"),
    СПОРТНО_ОБЛЕКЛО("Спортно облекло"),
    БЕЛЬО_ПИЖАМИ_И_ЧОРАПИ("Бельо, пижами и чорапи"),
    ПУЛОВЕРИ_СУИТЧЪРИ("Пуловери, суитчъри"),
    ТЕНИСКИ("Тениски"),
    САКА("Сака"),
    БЛУЗИ_РИЗИ_ТЕНИСКИ("Блузи, ризи, тениски"),
    РОКЛИ_ПОЛИ("Рокли, поли"),
    ПАНТАЛОНИ_КЪСИ_ПАНТАЛОНИ("Панталони, къси панталони"),
    СУИТЧЪРИ_ПУЛОВЕРИ_ЖИЛЕТКИ("Суитчъри, пуловери, жилетки"),
    ПЛАЖНО_ОБЛЕКЛО("Плажно облекло"),
    БЕЛЬО_И_ЧОРАПИ("Бельо и чорапи"),
    ПИЖАМИ("Пижами"),
    ПАНТАЛОНИ_И_ШОРТИ("Панталони и шорти"),
    ОБУВКИ_ЧАНТИ("Обувки, чанти"),
    КОЛАНИ_ПОРТМОНЕТА("Колани, портмонета"),
    ШАЛОВЕ_ШАПКИ_И_РЪКАВИЦИ("Шалове, шапки и ръкавици");

    private final String toString;

    ProductGroupsNamesEnum(String toString) {
        this.toString = toString;
    }

    public String toString() {
        return toString;
    }
}
